---
kind: property
id: P:Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs.ItemId
source: html/cd7219cc-bb33-74ad-1622-bd4fcc7f056a.htm
---
# Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs.ItemId Property

The id of the external data item to which a new reference has been added.

## Syntax (C#)
```csharp
public string ItemId { get; }
```